# 13.8

ЗАДАЧА
Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов. Программа должна работать следующим образом:

    1. В начале у пользователя запрашивается количество билетов, которые он хочет приобрести на мероприятие.
    2. Далее для каждого билета запрашивается возраст посетителя, в соответствии со значением которого выбирается стоимость:

Если посетителю конференции менее 18 лет, то он проходит на конференцию бесплатно.
От 18 до 25 лет — 990 руб.
От 25 лет — полная стоимость 1390 руб.
    3. В результате программы выводится сумма к оплате. При этом, если человек регистрирует больше трёх человек на конференцию, то дополнительно получает 10% скидку на полную стоимость заказа.
    4. Для проверки загрузите полученное решение на GitHub и прикрепите ссылку.
    https://github.com/Matiosov/13.8.git

РЕШЕНИЕ ЗАДАЧИ:

ticket = int(input('Введите количество билетов: '))
cost = 0.0
for i in range(ticket):
    age = int(input('Введите возраст: '))
    if age < 18:
        cost = cost + 0
    elif 18 <= age < 25:
        cost = cost + 990
    else: cost = cost + 1390
    if ticket > 3:
        cost = cost * 0.9
print('Итого'+ ' ' + str(round(cost)) + ' ' + 'рублей')

ОТВЕТ:
Введите количество билетов: 7

Введите возраст: 18
Введите возраст: 23
Введите возраст: 33
Введите возраст: 35
Введите возраст: 45
Введите возраст: 19
Введите возраст: 17
Итого 4548 рублей

Process finished with exit code 0
Process finished with exit code 0
